Revit 2026 API

# LayoutRuleClearSpacingSpacing Property

---

Get or set the spacing of the beam system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Spacing { get; set; }
```
```vb
Public Property Spacing As Double
	Get
	Set
```
```cpp
public:
property double Spacing {
	double get ();
	void set (double value);
}
```
```fsharp
member Spacing : float with get, set
```

#### Property Value

Double

The value of spacing must be in [0, 30000), but in fact the spacing should not be too small or too great.

#### Reference

LayoutRuleClearSpacing Class

Autodesk.Revit.DB Namespace